//-----------------------------------------------------------------
// 程序描述:
// 		 STM32内部ADC，lmt70测室温程序
// 作    者: 凌智电子
// 开始日期: 2020-09-08
// 完成日期: 2020-09-08
// 修改日期: 
// 当前版本: V1.0
// 历史版本:
//  - V1.0: 
// 调试工具: 凌智STM32F429+Cyclone IV电子系统设计开发板、LZE_ST_LINK2
// 说    明: 
//					 (1) 开发板和LMT70模块的连接
//					 开发板				LMT70模块
//						PA4						TAO
//						3V3						VCC
//						GND						GND
// 					 (2) 使用电脑的串口软件查看结果   
//-----------------------------------------------------------------

//-----------------------------------------------------------------
// 头文件包含
//-----------------------------------------------------------------
#include "stm32f429_winner.h"
#include "adc.h"
#include "delay.h"
#include "lcd.h"
#include "led.h"
#include "sdram.h"
#include "usart.h"
//-----------------------------------------------------------------

//-----------------------------------------------------------------
// 主程序
//-----------------------------------------------------------------
int main(void)
{
	u16 adcx;
	float temp;
	float T;
	HAL_Init();                     // 初始化HAL库   
	SystemClock_Config(360,25,2,8); // 设置时钟,180Mhz
	uart_init(115200);							// 初始化串口, 串口波特率115200bps
	LED_Init();                     // 初始化LED 
	MY_ADC_Init();                  // 初始化ADC1通道4
  while(1)
	{
    adcx=Get_Adc_Average(ADC_CHANNEL_1,100);// 获取通道4的转换值，100次取平均
		LCD_ShowxNum(134,130,adcx,4,16,0);     	// 显示ADCC采样后的原始值
		temp=(float)adcx*(3000.0/4095);      		// 获取计算后的带小数的实际电压值
		T=(-0.193)*temp+212.009;								// 计算温度值
		printf ("Voltage=%3.3fmV  Temperature=%3.3fC\r\n", temp,T);	// 串口发送相关信息
		delay_ms(750);
	}  
}

//-----------------------------------------------------------------
// End Of File
//-----------------------------------------------------------------
